<a href="https://colab.research.google.com/github/ricardoricrob76/unipe-cd/blob/main/Sexta-feira%2001%20-%20Explora%C3%A7%C3%A3o_de_Dados_Manipula%C3%A7%C3%A3o_com_Pandas%2C_Numpy%2C_Scipy%2C_MatplotLib.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Exploração de Dados - Manipulação com Pandas, Numpy, Scipy, MatplotLib
# Autor: Ricardo Roberto de Lima
# Data: 30/04/2022

In [ ]:
# Fazendo o import das bibliotecas de ciência de dados (Numpy, Pandas, Scipy, matplolib)
import numpy as np
import scipy as sp
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# criando um dafaframe com os dados da planilha de Salarios.csv..
df = pd.read_csv("Salaries.csv")

In [ ]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [ ]:
df.head(18)

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
12   AsstProf          B    1        0  Male   88000
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
16   AsstProf          B    8        3  Male   75044
17   AsstProf          B    4        0  Male   92000

In [ ]:
df.head(20)

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
12   AsstProf          B    1        0  Male   88000
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
16   AsstProf          B    8        3  Male   75044
17   AsstProf          B    4        0  Male   92000
18       Prof          A   19        7  Male  107300
19       Prof          A   29       27  Male  150500

In [ ]:
df.tail(15)

         rank discipline  phd  service     sex  salary
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df['salary'].dtype

dtype('int64')

In [ ]:
# Listandos os tipos de dados de todas as colunas do DataFrame
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [ ]:
# Listando os nomes das colunas
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [ ]:
# Listando os rótulos das linhas e colunas
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [ ]:
# Número de dimensões
df.ndim

2

In [ ]:
# Total de elementos no Data Frame
df.size

468

In [ ]:
# Número de Linhas e Colunas
df.shape

(78, 6)

In [ ]:
# Saída básica estatística para o número de colunas
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [ ]:
# Calcular a média para todas as colunas numericas
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [ ]:
# Exercícios Práticas

In [ ]:
# Calcular o Desvio Padrão para todas as colunas numericas
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [ ]:
# Calcular a média das colunas para os 50 primeiras linhas
df.head(10).mean()

phd            28.9
service        24.9
salary     110861.5
dtype: float64

In [ ]:
# Calcular o desvio padrão das colunas para os 10 últimas linhas
df.tail(10).std()

phd            8.130191
service        5.308274
salary     26459.073063
dtype: float64

## Data slicing and grouping

In [ ]:
df_sex = df.groupby('sex')

In [ ]:
df_sex['sex'].head(30)

0       Male
1       Male
2       Male
3       Male
4       Male
5       Male
6       Male
7       Male
8       Male
9       Male
10      Male
11      Male
12      Male
13      Male
14      Male
15      Male
16      Male
17      Male
18      Male
19      Male
20      Male
21      Male
22      Male
23      Male
24      Male
25      Male
26      Male
27      Male
28      Male
29      Male
39    Female
40    Female
41    Female
42    Female
43    Female
44    Female
45    Female
46    Female
47    Female
48    Female
49    Female
50    Female
51    Female
52    Female
53    Female
54    Female
55    Female
56    Female
57    Female
58    Female
59    Female
60    Female
61    Female
62    Female
63    Female
64    Female
65    Female
66    Female
67    Female
68    Female
Name: sex, dtype: object

In [ ]:
df.sex.head()

0    Male
1    Male
2    Male
3    Male
4    Male
Name: sex, dtype: object

In [ ]:
df['salary'].describe()

count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64

In [ ]:
df['salary'].count()

78

In [ ]:
df['salary'].mean()

108023.78205128205

## Utilizando o GrouBy

In [ ]:
df_rank = df.groupby('rank')

In [ ]:
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [ ]:
df.groupby('sex')['salary'].mean()

sex
Female    101002.410256
Male      115045.153846
Name: salary, dtype: float64

In [ ]:
df.groupby('sex')[['salary']].mean()

               salary
sex
Female  101002.410256
Male    115045.153846

In [ ]:
df.groupby(['sex','rank'], sort=True)[['salary']].mean()

                         salary
sex    rank
Female AssocProf   88512.800000
       AsstProf    78049.909091
       Prof       121967.611111
Male   AssocProf  102697.666667
       AsstProf    85918.000000
       Prof       124690.142857

In [ ]:
df.groupby('discipline')['salary'].mean()

discipline
A     98331.111111
B    116331.785714
Name: salary, dtype: float64

## Filtrando Dados

In [1]:
# Seleção e observação com valores de salário > 120000
df_sub = df[ df['salary'] > 120000]
df_sub.head()

NameError: ignored

In [ ]:
# Seleção dos dados para professores do sexo feminino
df_w = df[ df['sex'] == 'Female']
df_w.head(20)

In [ ]:
# Exercícios

In [ ]:
# Usando Filtros, localizando a média dos valores do salário por disciplina.
df[df['discipline'] == 'A']['salary'].mean()

In [ ]:
# Mudança
# Extração (Filtro) somente para observações com salários acima de 100K e localização com sexo feminino e masculino para professor de forma agrupada
df[df['salary'] > 120000].groupby('sex')['salary'].count()

## Mais Slicing de Dados com DataSet

In [ ]:
# Seleção da coluna Salário..
df1 = df['salary']

In [ ]:
# Checando o tipo de dados do resultado
type(df1)

pandas.core.series.Series

In [ ]:
# Verificando os primeiros elementos de saída
df1.head()

0    186960
1     93000
2    110515
3    131205
4    104800
Name: salary, dtype: int64

In [ ]:
# Seleção da Coluna Salário e saída para o objeto Data Frame
df2 = df[['salary']]

In [ ]:
# Checando o tipo de dados do resultado
type(df2)

pandas.core.frame.DataFrame

In [ ]:
#Select a subset of rows (based on their position):
# Note 1: The location of the first row is 0
# Note 2: The last value in the range is not included
df[0:10]

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [ ]:
# Aplicando os valores das linhas e colunas, usando o método .loc
df.loc[10:20,['rank', 'sex','salary']]

        rank   sex  salary
10      Prof  Male  128250
11      Prof  Male  134778
12  AsstProf  Male   88000
13      Prof  Male  162200
14      Prof  Male  153750
15      Prof  Male  150480
16  AsstProf  Male   75044
17  AsstProf  Male   92000
18      Prof  Male  107300
19      Prof  Male  150500
20  AsstProf  Male   92000

In [ ]:
# Verificando o que foi obtida para o DataFrame df_sub 
# Método .loc subconjunto do data frame baseado nos rótulos de dados:
df_sub.loc[10:20,['rank','sex','salary']]

    rank   sex  salary
10  Prof  Male  128250
11  Prof  Male  134778
13  Prof  Male  162200
14  Prof  Male  153750
15  Prof  Male  150480
19  Prof  Male  150500

In [ ]:
#  Ao contrário do método .loc, o método .iloc seleciona linhas e colunas por posição:
df_sub.iloc[10:20, [0,3,4,5]]

    rank  service     sex  salary
26  Prof       19    Male  148750
27  Prof       43    Male  155865
29  Prof       20    Male  123683
31  Prof       21    Male  155750
35  Prof       23    Male  126933
36  Prof       45    Male  146856
39  Prof       18  Female  129000
40  Prof       36  Female  137000
44  Prof       19  Female  151768
45  Prof       25  Female  140096

## Ordenação dos Dados

In [ ]:
# Ordenar o quadro de dados por yrs.service e depois criar um novo quadro de dados
df_sorted = df.sort_values(by = 'service')
df_sorted.head()

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

In [ ]:
# Ordenar o Data Frame por by yrs.service and subscrever o original dataset
df.sort_values(by = 'service', ascending = False, inplace = True)
df.head()

    rank discipline  phd  service     sex  salary
9   Prof          A   51       51    Male   57800
0   Prof          B   56       49    Male  186960
36  Prof          B   45       45    Male  146856
27  Prof          A   45       43    Male  155865
40  Prof          A   39       36  Female  137000

In [ ]:
# Restaurar a ordenação original (by sorting using index)
df.sort_index(axis=0, ascending = True, inplace = True)
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [ ]:
# Exercícios Práticos..

In [ ]:
# Classificar o data frame pelo salário (em ordem decrescente) and exibir os primeiros registros de saída
df.sort_values(by='salary', ascending=False).head()

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
72  Prof          B   24       15  Female  161101
27  Prof          A   45       43    Male  155865
31  Prof          B   22       21    Male  155750

In [ ]:
# Classificar o data frame usando 2 ou mais colunas:
df_sorted = df.sort_values(by = ['service', 'salary'], ascending = [True,False])
df_sorted.head(10)

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
55  AsstProf          A    2        0  Female   72500
57  AsstProf          A    3        1  Female   72500
28  AsstProf          B    7        2    Male   91300
42  AsstProf          B    4        2  Female   80225
68  AsstProf          A    4        2  Female   77500

## Valores Nulos ou Não válidos

In [ ]:
# Lendo o Dataset com valores nulos ou inválidos
flights = pd.read_csv("flights.csv")
flights.head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400.0,5.0,17.0
1,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416.0,5.0,33.0
2,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089.0,5.0,42.0
3,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762.0,5.0,54.0
4,2013,1,1,554.0,-4.0,740.0,12.0,UA,N39463,1696,EWR,ORD,150.0,719.0,5.0,54.0

In [ ]:
# Selecionar linhas que tenham pelo menos um valor ausente ou nulo
flights[flights.isnull().any(axis=1)].head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
330,2013,1,1,1807.0,29.0,2251.0,NaN,UA,N31412,1228,EWR,SAN,NaN,2425.0,18.0,7.0
403,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EHAA,791,LGA,DFW,NaN,1389.0,NaN,NaN
404,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EVAA,1925,LGA,MIA,NaN,1096.0,NaN,NaN
855,2013,1,2,2145.0,16.0,NaN,NaN,UA,N12221,1299,EWR,RSW,NaN,1068.0,21.0,45.0
858,2013,1,2,NaN,NaN,NaN,NaN,AA,NaN,133,JFK,LAX,NaN,2475.0,NaN,NaN

In [ ]:
# Filtar todas as linhas onde o valor arr_delay estão faltando ou nulos:
flights1 = flights[ flights['arr_delay'].notnull( )]
flights1.head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400.0,5.0,17.0
1,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416.0,5.0,33.0
2,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089.0,5.0,42.0
3,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762.0,5.0,54.0
4,2013,1,1,554.0,-4.0,740.0,12.0,UA,N39463,1696,EWR,ORD,150.0,719.0,5.0,54.0

In [ ]:
# Remover todas as observações com valores nulos
flights2 = flights.dropna()

In [ ]:
# Preenchendo os valores ausentes com zeros
nomiss =flights['dep_delay'].fillna(means())
nomiss.isnull().any()

NameError: name 'means' is not defined

In [ ]:
flights.count()

In [ ]:
# Exercícios

In [ ]:
# Contar quantos dados ausentes estão nas colunas dep_dalay e arr_delay
flights[['dep_delay','arr_delay']].isnull().sum()

## Funções comuns de Agregação

In [ ]:
#Function 	Description
#min 	minimum
#max 	maximum
#count 	number of non-null observations
#sum 	sum of values
#mean 	arithmetic mean of values
#median 	median
#mad 	mean absolute deviation
#mode 	mode
#prod 	product of values
#std 	standard deviation
#var 	unbiased variance

In [ ]:
# Localizar o número de valores não nulos para cada coluna
flights.count()

In [ ]:
# Localizando os valores mínimos para todas as colunas do dataset
flights.min()

In [ ]:
# Calculando a Estatística de resumo por grupo (média):
flights.groupby('carrier')['dep_delay'].mean()

In [ ]:
# É possível usar o método agg() para agregação..
flights[['dep_delay','arr_delay']].agg(['min','mean','max'])

In [ ]:
# Um exemplo de computação de estatísticas diferentes para diferentes colunas
flights.agg({'dep_delay':['min','mean',max], 'carrier':['nunique']})

## Estatística Descritiva Básica

In [ ]:
#Function 	Description
#min 	minimum
#max 	maximum
#mean 	arithmetic mean of values
#median 	median
#mad 	mean absolute deviation
#mode 	mode
#std 	standard deviation
#var 	unbiased variance
#sem 	standard error of the mean
#skew 	sample skewness
#kurt 	kurtosis
#quantile 	value at %

In [ ]:
# A função conveniente describe() calcula uma variedade de estatísticas
flights.dep_delay.describe()

In [ ]:
# Localizar e indexar o máximo e mínimo dos valores
# if there are multiple values matching idxmin() and idxmax() will return the first match
flights['dep_delay'].idxmin()  #minimum value

In [ ]:
# Contar o número de registro para cada valor diferente em um vetor
flights['carrier'].value_counts()

## Explorando Dados e Usando Gráficos

In [ ]:
# Mostrando Gráficos com Python no Notebook
%matplotlib inline

In [ ]:
# Usando Matplotlib para desenhar um histogram para a coluna salário
plt.hist(df['salary'],bins=8)

In [ ]:
# Usando o seaborn package para desenhar o histograma
sns.distplot(df['salary']);

In [ ]:
# O uso regular do matplotlib para mostrar o "Gráfico de Barras" barplot
df.groupby(['rank'])['salary'].count().plot(kind='bar')

In [ ]:
# O uso do seaborn para mostrar o Gráfico de Barras
sns.set_style("whitegrid")
ax = sns.barplot(x='rank',y ='salary', data=df, estimator=len)

In [ ]:
# Dividindo o gráfico em 02 grupos:
ax = sns.barplot(x='rank',y ='salary', hue='sex', data=df, estimator=len)

In [ ]:
#Violinplot
sns.violinplot(x = "salary", data=df)

In [ ]:
#Scatterplot in seaborn
sns.jointplot(x='service', y='salary', data=df)

In [ ]:
#Se estivermos em gráficos para representar a regressão linear para 2 variáveis numéricas - regplot
sns.regplot(x='service', y='salary', data=df)

In [ ]:
# box plot - é um tipo de Gráfico muito utilizado para detectar Out-lier
sns.boxplot(x='rank',y='salary', data=df)

In [ ]:
# side-by-side box plot - com parâmetros de Rank com Salario aplicados ao Sexo
sns.boxplot(x='rank',y='salary', data=df, hue='sex')

In [ ]:
# swarm plot
sns.swarmplot(x='rank',y='salary', data=df)

In [ ]:
#factorplot - Gráficos de Barras do tipo: FactorPlot
sns.factorplot(x='carrier',y='dep_delay', data=flights, kind='bar')

In [ ]:
# Pairplot 
sns.pairplot(df)

In [ ]:
#Exercício Prático

In [ ]:
#Using seaborn package explore the dependency of arr_delay on dep_delay (scatterplot or regplot) for flights dataset
sns.jointplot(x='dep_delay', y='arr_delay', data=flights)

## Analise Estatística Básica

## - Linear Regression

In [ ]:
# Import Statsmodel functions:
import statsmodels.formula.api as smf

In [ ]:
# Criando o Modelo Fitted
lm = smf.ols(formula='salary ~ service', data=df).fit()

# Exibindo o modelo do sumário.
print(lm.summary())

In [ ]:
# Exibindo o Coeficiente.
lm.params

In [ ]:
#using scikit-learn:
from sklearn import linear_model
est = linear_model.LinearRegression(fit_intercept = True)   # create estimator object
est.fit(df[['service']], df[['salary']])

#print result
print("Coef:", est.coef_, "\nIntercept:", est.intercept_)

In [ ]:
# Exercício

In [ ]:
# Build a linear model for arr_delay ~ dep_delay
lm = smf.ols(formula='arr_delay ~ dep_delay', data=flights).fit()

#print model summary
print(lm.summary())

In [ ]:
# Test - para Estudantes

In [ ]:
# Using scipy package:

from scipy import stats
df_w = df[ df['sex'] == 'Female']['salary']
df_m = df[ df['sex'] == 'Male']['salary']
stats.ttest_ind(df_w, df_m)